IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G1_EPWM19_CONTROLSS_G1_EPWM19.xml
	<register id="CONTROLSS_G1_EPWM19_GLDCTL2" acronym="CONTROLSS_G1_EPWM19_GLDCTL2" offset="0xE8" width="16" description="Global PWM Load Control Register 2">
		<bitfield id="GFRCLD" width="1" begin="1" end="1" resetval="0x0" description="Force Load Event in One Shot Mode   0: Writing of 0 will be ignored. Always reads back a 0.  1: Force one load event at the input of the event pre-scale counter as shown in the diagram below. This bit is intended to be used for testing and/or software force loading of the events in global load mode." range="1" rwaccess="R/W1TS"/> 
		<bitfield id="OSHTLD" width="1" begin="0" end="0" resetval="0x0" description="Enable Reload Event in One Shot Mode   0: Writing of 0 will be ignored. Always reads back a 0.  1: Turns the one shot latch condition ON. Upon occurrence of a chosen load strobe, one shadow to active reload occurs and the latch will be cleared. Hence writing 1 to this bit would allow one load strobe event to pass through and block further strobe events." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G1_EPWM19_SWVDELVAL" acronym="CONTROLSS_G1_EPWM19_SWVDELVAL" offset="0xEE" width="16" description="Software Valley Mode Delay Register">
		<bitfield id="SWVDELVAL" width="16" begin="15" end="0" resetval="0x0" description="Software Valley Delay Value Register  This register can be optionally used define offset value for the hardware calculated delay HWDELAYVAL as defined in VCAPCTL[VDELAYDIV] bits." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM19_TZSEL" acronym="CONTROLSS_G1_EPWM19_TZSEL" offset="0x100" width="16" description="Trip Zone Select Register ">
		<bitfield id="DCBEVT1" width="1" begin="15" end="15" resetval="0x0" description="Digital Compare Output B Event 1 Select   0: Disable DCBEVT1 as one-shot-trip source for this ePWM module.  1: Enable DCBEVT1 as one-shot-trip source for this ePWM module." range="15" rwaccess="R/W"/> 
		<bitfield id="DCAEVT1" width="1" begin="14" end="14" resetval="0x0" description="Digital Compare Output A Event 1 Select   0: Disable DCAEVT1 as one-shot-trip source for this ePWM module.  1: Enable DCAEVT1 as one-shot-trip source for this ePWM module." range="14" rwaccess="R/W"/> 
		<bitfield id="OSHT6" width="1" begin="13" end="13" resetval="0x0" description="Trip-zone 6 [TZ6] Select   0: Disable TZ6 as a one-shot trip source for this ePWM module  1: Enable TZ6 as a one-shot trip source for this ePWM module" range="13" rwaccess="R/W"/> 
		<bitfield id="OSHT5" width="1" begin="12" end="12" resetval="0x0" description="Trip-zone 5 [TZ5] Select   0: Disable TZ5 as a one-shot trip source for this ePWM module  1: Enable TZ5 as a one-shot trip source for this ePWM module" range="12" rwaccess="R/W"/> 
		<bitfield id="OSHT4" width="1" begin="11" end="11" resetval="0x0" description="Trip-zone 4 [TZ4] Select   0: Disable TZ4 as a one-shot trip source for this ePWM module  1: Enable TZ4 as a one-shot trip source for this ePWM module" range="11" rwaccess="R/W"/> 
		<bitfield id="OSHT3" width="1" begin="10" end="10" resetval="0x0" description="Trip-zone 3 [TZ3] Select   0: Disable TZ3 as a one-shot trip source for this ePWM module  1: Enable TZ3 as a one-shot trip source for this ePWM module" range="10" rwaccess="R/W"/> 
		<bitfield id="OSHT2" width="1" begin="9" end="9" resetval="0x0" description="Trip-zone 2 [TZ2] Select   0: Disable TZ2 as a one-shot trip source for this ePWM module  1: Enable TZ2 as a one-shot trip source for this ePWM module" range="9" rwaccess="R/W"/> 
		<bitfield id="OSHT1" width="1" begin="8" end="8" resetval="0x0" description="Trip-zone 1 [TZ1] Select   0: Disable TZ1 as a one-shot trip source for this ePWM module  1: Enable TZ1 as a one-shot trip source for this ePWM module" range="8" rwaccess="R/W"/> 
		<bitfield id="DCBEVT2" width="1" begin="7" end="7" resetval="0x0" description="Digital Compare Output B Event 2 Select   0: Disable DCBEVT2 as a CBC trip source for this ePWM module  1: Enable DCBEVT2 as a CBC trip source for this ePWM module" range="7" rwaccess="R/W"/> 
		<bitfield id="DCAEVT2" width="1" begin="6" end="6" resetval="0x0" description="Digital Compare Output A Event 2 Select   0: Disable DCAEVT2 as a CBC trip source for this ePWM module  1: Enable DCAEVT2 as a CBC trip source for this ePWM module" range="6" rwaccess="R/W"/> 
		<bitfield id="CBC6" width="1" begin="5" end="5" resetval="0x0" description="Trip-zone 6 [TZ6] Select   0: Disable TZ6 as a CBC trip source for this ePWM module  1: Enable TZ6 as a CBC trip source for this ePWM module" range="5" rwaccess="R/W"/> 
		<bitfield id="CBC5" width="1" begin="4" end="4" resetval="0x0" description="Trip-zone 5 [TZ5] Select   0: Disable TZ5 as a CBC trip source for this ePWM module  1: Enable TZ5 as a CBC trip source for this ePWM module" range="4" rwaccess="R/W"/> 
		<bitfield id="CBC4" width="1" begin="3" end="3" resetval="0x0" description="Trip-zone 4 [TZ4] Select   0: Disable TZ4 as a CBC trip source for this ePWM module  1: Enable TZ4 as a CBC trip source for this ePWM module" range="3" rwaccess="R/W"/> 
		<bitfield id="CBC3" width="1" begin="2" end="2" resetval="0x0" description="Trip-zone 3 [TZ3] Select   0: Disable TZ3 as a CBC trip source for this ePWM module  1: Enable TZ3 as a CBC trip source for this ePWM module" range="2" rwaccess="R/W"/> 
		<bitfield id="CBC2" width="1" begin="1" end="1" resetval="0x0" description="Trip-zone 2 [TZ2] Select   0: Disable TZ2 as a CBC trip source for this ePWM module  1: Enable TZ2 as a CBC trip source for this ePWM module" range="1" rwaccess="R/W"/> 
		<bitfield id="CBC1" width="1" begin="0" end="0" resetval="0x0" description="Trip-zone 1 [TZ1] Select   0: Disable TZ1 as a CBC trip source for this ePWM module  1: Enable TZ1 as a CBC trip source for this ePWM module" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM19_TZSEL2" acronym="CONTROLSS_G1_EPWM19_TZSEL2" offset="0x102" width="16" description="Trip Zone Select Register 2">
		<bitfield id="CAPEVTOST" width="1" begin="8" end="8" resetval="0x0" description="CAPEVT OST Select   0: Disable CAPEVT as a one-shot trip source for this ePWM module  1: Enable CAPEVT as a one-shot trip source for this ePWM module" range="8" rwaccess="R/W"/> 
		<bitfield id="CAPEVTCBC" width="1" begin="0" end="0" resetval="0x0" description="CAPEVT  CBC mode Select   0: Disable CAPEVT as a CBC trip source for this ePWM module  1: Enable CAPEVT as a CBC trip source for this ePWM module" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM19_TZDCSEL" acronym="CONTROLSS_G1_EPWM19_TZDCSEL" offset="0x104" width="16" description="Trip Zone Digital Comparator Select Register">
		<bitfield id="DCBEVT2" width="3" begin="11" end="9" resetval="0x0" description="Digital Compare Output B Event 2 Selection   000: Event disabled  001: DCBH = low, DCBL = don't care  010: DCBH = high, DCBL = don't care  011: DCBL = low, DCBH = don't care  100: DCBL = high, DCBH = don't care  101: DCBL = high, DCBH = low  110: Reserved  111: Reserved" range="11 - 9" rwaccess="R/W"/> 
		<bitfield id="DCBEVT1" width="3" begin="8" end="6" resetval="0x0" description="Digital Compare Output B Event 1 Selection   000: Event disabled  001: DCBH = low, DCBL = don't care  010: DCBH = high, DCBL = don't care  011: DCBL = low, DCBH = don't care  100: DCBL = high, DCBH = don't care  101: DCBL = high, DCBH = low  110: Reserved  111: Reserved" range="8 - 6" rwaccess="R/W"/> 
		<bitfield id="DCAEVT2" width="3" begin="5" end="3" resetval="0x0" description="Digital Compare Output A Event 2 Selection   000: Event disabled  001: DCAH = low, DCAL = don't care  010: DCAH = high, DCAL = don't care  011: DCAL = low, DCAH = don't care  100: DCAL = high, DCAH = don't care  101: DCAL = high, DCAH = low  110: Reserved  111: Reserved" range="5 - 3" rwaccess="R/W"/> 
		<bitfield id="DCAEVT1" width="3" begin="2" end="0" resetval="0x0" description="Digital Compare Output A Event 1 Selection   000: Event disabled  001: DCAH = low, DCAL = don't care  010: DCAH = high, DCAL = don't care  011: DCAL = low, DCAH = don't care  100: DCAL = high, DCAH = don't care  101: DCAL = high, DCAH = low  110: Reserved  111: Reserved" range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM19_TZCTL" acronym="CONTROLSS_G1_EPWM19_TZCTL" offset="0x108" width="16" description="Trip Zone Control Register">
		<bitfield id="DCBEVT2" width="2" begin="11" end="10" resetval="0x0" description="Digital Compare Output B Event 2 Action On EPWMxB   00: High-impedance [EPWMxB = High-impedance state]  01: Force EPWMxB to a high state.  10: Force EPWMxB to a low state.  11: Do Nothing, trip action is disabled" range="11 - 10" rwaccess="R/W"/> 
		<bitfield id="DCBEVT1" width="2" begin="9" end="8" resetval="0x0" description="Digital Compare Output B Event 1 Action On EPWMxB   00: High-impedance [EPWMxB = High-impedance state]  01: Force EPWMxB to a high state.  10: Force EPWMxB to a low state.  11: Do Nothing, trip action is disabled" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="DCAEVT2" width="2" begin="7" end="6" resetval="0x0" description="Digital Compare Output A Event 2 Action On EPWMxA   00: High-impedance [EPWMxA = High-impedance state]  01: Force EPWMxA to a high state.  10: Force EPWMxA to a low state.  11: Do Nothing, trip action is disabled" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="DCAEVT1" width="2" begin="5" end="4" resetval="0x0" description="Digital Compare Output A Event 1 Action On EPWMxA   00: High-impedance [EPWMxA = High-impedance state]  01: Force EPWMxA to a high state.  10: Force EPWMxA to a low state.  11: Do Nothing, trip action is disabled" range="5 - 4" rwaccess="R/W"/> 
		<bitfield id="TZB" width="2" begin="3" end="2" resetval="0x0" description="TZ1 to TZ6, DCAEVT1/2, DCBEVT1/2Trip Action On EPWMxB  When a trip event occurs the following action is taken on output EPWMxB. Which trip-zone pins can cause an event is defined in the TZSEL register.   00: High-impedance [EPWMxB = High-impedance state]  01: Force EPWMxB to a high state  10: Force EPWMxB to a low state  11: Do nothing, no action is taken on EPWMxB." range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="TZA" width="2" begin="1" end="0" resetval="0x0" description="TZ1 to TZ6, DCAEVT1/2, DCBEVT1/2 Trip Action On EPWMxA  When a trip event occurs the following action is taken on output EPWMxA. Which trip-zone pins can cause an event is defined in the TZSEL register.   00: High-impedance [EPWMxA = High-impedance state]  01: Force EPWMxA to a high state  10: Force EPWMxA to a low state  11: Do nothing, no action is taken on EPWMxA." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM19_TZCTL2" acronym="CONTROLSS_G1_EPWM19_TZCTL2" offset="0x10A" width="16" description="Additional Trip Zone Control Register">
		<bitfield id="ETZE" width="1" begin="15" end="15" resetval="0x0" description="TZCTL2 Enable   0: Use trip action from TZCTL [legacy EPWM compatibility]  1: Use trip action defined in TZCTL2, TZCTLDCA and TZCTLDCB. Settings in TZCTL are ignored" range="15" rwaccess="R/W"/> 
		<bitfield id="TZBD" width="3" begin="11" end="9" resetval="0x0" description="TZ1 to TZ6 Trip Action On EPWMxB while Count direction is DOWN   000: HiZ [EPWMxB = HiZ state]  001: Forced Hi [EPWMxB = High state]  010: Forced Lo [EPWMxB = Lo state]  011: Toggle [Low -> High, High -> Low]  100: Reserved  101: Reserved  110: Reserved  111: Do Nothing, trip action is disabled" range="11 - 9" rwaccess="R/W"/> 
		<bitfield id="TZBU" width="3" begin="8" end="6" resetval="0x0" description="TZ1 to TZ6, DCAEVT1/2, DCBEVT1/2 Trip Action On EPWMxB while Count direction is UP   000: HiZ [EPWMxB = HiZ state]  001: Forced Hi [EPWMxB = High state]  010: Forced Lo [EPWMxB = Lo state]  011: Toggle [Low -> High, High -> Low]  100: Reserved  101: Reserved  110: Reserved  111: Do Nothing, trip action is disabled" range="8 - 6" rwaccess="R/W"/> 
		<bitfield id="TZAD" width="3" begin="5" end="3" resetval="0x0" description="TZ1 to TZ6, DCAEVT1/2, DCBEVT1/2 Trip Action On EPWMxA while Count direction is DOWN   000: HiZ [EPWMxA = HiZ state]  001: Forced Hi [EPWMxA = High state]  010: Forced Lo [EPWMxA = Lo state]  011: Toggle [Low -> High, High -> Low]  100: Reserved  101: Reserved  110: Reserved  111: Do Nothing, trip action is disabled" range="5 - 3" rwaccess="R/W"/> 
		<bitfield id="TZAU" width="3" begin="2" end="0" resetval="0x0" description="TZ1 to TZ6, DCAEVT1/2, DCBEVT1/2 Trip Action On EPWMxA while Count direction is UP   000: HiZ [EPWMxA = HiZ state]  001: Forced Hi [EPWMxA = High state]  010: Forced Lo [EPWMxA = Lo state]  011: Toggle [Low -> High, High -> Low]  100: Reserved  101: Reserved  110: Reserved  111: Do Nothing, trip action is disabled" range="2 - 0" rwaccess="R/W"/>
	</register>
